Pada sesi ini kita akan belajar mengenai:
* Read and Inspect Data
* Data Structures in Pandas
* Indexing and Selection
* Data Manipulations

---
# Data Wrangling

## Apa itu Data Wrangling?
- Disebut juga dengan *Data Munging*
- Proses untuk mentransformasi data mentah menjadi format yang diinginkan.
- Transformasi tersebut termasuk membersihkan, menstrukturkan, dan mengubah format data.
- Setelah data ditransformasi menjadi bentuk yang sesuai, maka dapat dilakukan proses lebih lanjut seperti:
    - Analisis data
    - Agregasi data
    - Visualisasi data
    - Membuat model statistik/prediksi
    - dll

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
data = pd.read_csv('titanic.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Data Wrangling dalam Python
Di dalam Python terdapat struktur data _default_ seperti:
* Tuple
* List
* Set
* Dictionary

**Contoh Tuple dan List**

In [1]:
tuple_1 = ('mangga','jeruk','nanas','apel','salak')
print(tuple_1)

('mangga', 'jeruk', 'nanas', 'apel', 'salak')

In [2]:
nested_list = [[2,5,4],[3,4,7],[8,2,7]]
print(nested_list)

[[2, 5, 4], [3, 4, 7], [8, 2, 7]]

**Contoh Set dan Dictionary**

In [3]:
set_1 = {1,3,4,4,5,4,7,7,6,5,2}
print(set_1)

{1, 2, 3, 4, 5, 6, 7}

In [4]:
dict_1 = {'Budi':{'IPA':80, 'IPS':90}, 'Tono':{'IPA':95, 'IPS':77}}
print(dict_1)

{'Budi': {'IPA': 80, 'IPS': 90}, 'Tono': {'IPA': 95, 'IPS': 77}}

### Permasalahan

Dengan tipe struktur data di atas, kita sudah bisa memanipulasi data sederhana. Namun, bagaimana jika data yang dianalisis berbentuk tabular seperti ini?

<img src="https://d13ot9o61jdzpp.cloudfront.net/images/tabular_data_1_the_perfect_format.png" alt="Drawing" width= 500px;/>

<small>[Source](https://d13ot9o61jdzpp.cloudfront.net/images/tabular_data_1_the_perfect_format.png)</small>

Data tabular seperti itu seringkali disimpan dalam format `.xlsx`, `.csv`, atau disimpan di dalam database `SQL`. Sehingga akan cukup sulit jika kita ingin mengolah data tersebut kedalam struktur data dasar. Walaupun secara praktek sebenarnya dapat dilakukan.

Sehingga, untuk mempermudah pengolahan bentuk data tabular, digunakan package Python yang bernama `Pandas`

### Pandas
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png" alt="Drawing" width= 300px;/>

<small>[Source](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png)</small>

Untuk mempermudah kita untuk menganalisis data maka kita dapat menggunakan `library` tambahan di dalam Python yang disebut dengan **Pandas**.
* Library ini dibuat khusus untuk kebutuhan manipulasi data dan analisis data pada Python.
* Pandas bersifat _open-source_, sehingga dapat diunduh dengan bebas.

#### Menggunakan Pandas

* Sebelum menggunakan pandas, maka kita harus memastikan di dalam sistem kita sudah terinstall pandas.
* Jika belum, maka dapat digunakan perintah `pip install pandas` pada terminal / command prompt.
* Untuk menggunakan pandas, langkah pertama yang dilakukan adalah dengan _import_ library pandas.

In [2]:
import pandas as pd

* Pada perintah diatas kita mengimport `pandas` sebagai `pd`.
* Yang berarti untuk selanjutnya kita dapat memanggil `pandas` dengan `pd`.
* Karena permasalahan utama adalah pengolahan data. Maka, hal yang perlu diperhatikan adalah komponen utama dalam pandas adalah struktur data.

#### Struktur Data Pandas

* Sebelum masuk lebih jauh, akan dikenalkan dulu secara sekilas tipe struktur data pada `pandas`.
* Jika Python memiliki struktur data seperti `tuple`,`list`,`dictionary`, dll.
* Maka Pandas memiliki dua tipe struktur data utama yang bernama `Series` dan `DataFrame`

##### Series

* Series adalah struktur data satu dimensi pada Pandas.
* Jika diibaratkan, Series adalah `list` satu dimensi pada Python.
* Kita dapat membuat `Series` dari `list` sederhana.

In [5]:
list_city = ['Bern','Zurich','Lausanne','Geneva','Basel']

In [6]:
series_city = pd.Series(list_city)
print(series_city)

0        Bern
1      Zurich
2    Lausanne
3      Geneva
4       Basel
dtype: object

In [8]:
list_number = [1,3,5,7,9,11]
series_number = pd.Series(list_number)
print(series_number)

0     1
1     3
2     5
3     7
4     9
5    11
dtype: int64

In [9]:
type(series_city)

pandas.core.series.Series

* Series pada pandas terdiri dari beberapa komponen.
* Angka di sebelah kiri merupakan index dari suatu nilai.
* Komponen di sebelah kanan adalah nilai dari Series.
* Di bagian bawah terdapat informasi tipe data yang digunakan.

##### DataFrame
* DataFrame adalah struktur data yang merepresentasikan data tabular.
* Konsepnya sama dengan spreadsheet pada Microsoft Excel.
* Dapat memiliki tipe elemen yang berbeda di dalamnya.
* Bentuk paling sederhana dari `DataFrame` dapat dibuat dari `dictionary`

In [8]:
data = {'state':['Ohio','Nevada','Washington','Texas','Texas','California'],
        'year':[2000,2001,2002,2004,2006,2003],
        'pop':[1.5,1.7,1.6,1.8,2.1,2.5]}

In [9]:
df_data = pd.DataFrame(data)
print(df_data)

        state  year  pop
0        Ohio  2000  1.5
1      Nevada  2001  1.7
2  Washington  2002  1.6
3       Texas  2004  1.8
4       Texas  2006  2.1
5  California  2003  2.5

* DataFrame terdiri dari beberapa komponen.
* Kolom paling kiri merupakan indeks dari data.
* Di bagian atas merupakan nama dari tiap-tiap kolom.
* Di bagian tengah adalah data yang dimasukkan.